In [2]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input

In [3]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ······

'Connected: root@bank'

In [4]:
%%sql
select * from bank.trans limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(695247, 2378, 930101, 'PRIJEM', 'VKLAD', 700.0, 700.0, '', '', 0),
 (171812, 576, 930101, 'PRIJEM', 'VKLAD', 900.0, 900.0, '', '', 0),
 (207264, 704, 930101, 'PRIJEM', 'VKLAD', 1000.0, 1000.0, '', '', 0),
 (1117247, 3818, 930101, 'PRIJEM', 'VKLAD', 600.0, 600.0, '', '', 0),
 (579373, 1972, 930102, 'PRIJEM', 'VKLAD', 400.0, 400.0, '', '', 0)]

In [6]:
%%sql
select count(account_id) from bank.trans

 * mysql+pymysql://root:***@localhost/bank
1 rows affected.

[(868019,)]

In [11]:
%%sql
select distinct(account_id), type from bank.trans
limit 1

 * mysql+pymysql://root:***@localhost/bank
1 rows affected.

[(2378, 'PRIJEM')]

In [16]:
%%sql
select type, sum(amount) 
from bank.trans
group by type

 * mysql+pymysql://root:***@localhost/bank
3 rows affected.

[('PRIJEM', 2303834281.3982244),
 ('VYDAJ', 2233057828.1949124),
 ('VYBER', 176513974.0)]

In [22]:
%%sql
select account_id, amount, nth_value(amount, 2) over (order by amount desc)
from bank.trans
limit 10

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[(998, 87400.0, None),
 (4462, 87300.0, 87300.0),
 (2915, 86400.0, 87300.0),
 (4130, 85800.0, 87300.0),
 (4014, 81900.0, 87300.0),
 (3886, 80700.0, 87300.0),
 (4269, 80700.0, 87300.0),
 (8759, 80400.0, 87300.0),
 (390, 80400.0, 87300.0),
 (2598, 78900.0, 87300.0)]